mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
  /*

    Return the new appended node's name or key of server returned payload when calling pushXXX function.

    @return String (String object).

  */
  String pushName();

  /*

    Determine the stream connection status.

    @return Boolean type status indicates whether the Firebase Data object is working with stream or not.

  */
  bool isStream();

  /*

    Determine the server connection status.

    @return Boolean type status indicates whether the Firebase Data object is connected to server or not.

  */
  bool httpConnected();

  /*

    Determine the timeout event of server's stream (30 sec is default).

    Nothing to do when stream connection timeout, the stream connection will be automatic resumed.

    @return Boolean type status indicates whether the stream was timeout or not.

  */
  bool streamTimeout();

  /*

    Determine the availability of data or paylaod returned from server.

    @return Boolean type status indicates whether the server return back the new payload or not.

  */
  bool dataAvailable();

  /*

    Determine the availability of stream event-data paylaod returned from server.

    @return Boolean type status indicates whether the server return back the stream event-data
    payload or not.

  */
  bool streamAvailable();

  /*

    Determine the matching between data type that intend to get from/store to database and the server's return payload data type.

    @return Boolean type status indicates whether the type of data being get from/store to database
    and server's returned payload are matched or not.

  */
  bool mismatchDataType();

  /*

    Determine the http status code return from server.

    @return integer number of HTTP status.

  */
  int httpCode();

  /*

    Check overflow of the returned payload data buffer.

    @return The overflow status.

    Default buffer size is 400 bytes, assigned via FIREBASE_RESPONSE_SIZE macro in FirebaseESP8266.h

  */
  bool bufferOverflow();

  /*

    Determine the name (full path) of backup file in SD card.

    @return String (String object) of file name that store on SD card after backup operation.

  */
  String getBackupFilename();

  /*

    Determine the size of backup file.

    @return Size of backup file in byte after backup operation.

  */
  size_t getBackupFileSize();

  /*

    Clear or empty data in Firebase Data object.

  */
  void clear();

  /*
    Determine the error description for file transfering (pushFile, setFile, backup and restore).

    @return Error description string (String object).

  */
  String fileTransferError();

  /*
    Return the server's payload data.

    @return Payload string (String object).

  */
  String payload();

  QueryFilter queryFilter;

  friend QueueManager;

protected:
  bool _firebaseCall = false;
  bool _streamCall = false;
  bool _isStreamTimeout = false;
  bool _isStream = false;
  bool _streamStop = false;
  bool _isSilentResponse = false;
  bool _bufferOverflow = false;
  bool _streamDataChanged = false;
  bool _streamPathChanged = false;
  bool _dataAvailable = false;
  bool _keepAlive = false;
  bool _httpConnected = false;
  bool _interruptRequest = false;
  bool _mismatchDataType = false;
  bool _pathNotExist = false;
  bool _pause = false;
  bool _file_transfering = false;
  int _dataType = 0;
  int _dataType2 = 0;
  uint8_t _dataTypeNum = 0;
  uint8_t _connectionStatus = 0;
  uint32_t _qID = 0;
  QueueManager _qMan;
  uint8_t _maxRetry = 0;

  uint8_t _r_method = 0;
  uint8_t _r_dataType = 0;

  std::string _path = "";
  std::string _path2 = "";
  std::string _data = "";
  std::string _data2 = "";
  std::string _streamPath = "";
  std::string _pushName = "";
  std::string _file_transfer_error = "";
  std::string _fileName = "";
  std::string _redirectURL = "";
  std::string _firebaseError = "";
  std::string _eventType = "";

  uint16_t _maxBlobSize = 1024;

  std::vector<uint8_t> _blob = std::vector<uint8_t>();

  int _httpCode = -1000;
  int _contentLength = 0;

  unsigned long _dataMillis = 0;
  unsigned long _streamMillis = 0;
  unsigned long _streamResetMillis = 0;

  std::string _backupNodePath = "";
  std::string _backupDir = "";
  std::string _backupFilename = "";
  size_t _backupzFileSize = 0;

  FirebaseHTTPClient _http;

  void addQueue(uint8_t firebaseMethod,
                uint8_t firebaseDataType,
                const std::string path,
                const std::string filename,
                const std::string payload,
                bool isQuery,
                int *intTarget,
                float *floatTarget,
                double *doubleTarget,
                bool *boolTarget,
                String *stringTarget,
                std::vector<uint8_t> *blobTarget);

  void clearQueueItem(QueueItem &item);

  void setQuery(QueryFilter &query);

  friend FirebaseESP8266;
};

class StreamData
{
public:
  StreamData();
  ~StreamData();
  String dataPath();
  String streamPath();
  int intData();
  float floatData();
  double doubleData();
  bool boolData();
  String stringData();
  String jsonData();
  String dataType();
  String eventType();
  void empty();
  friend FirebaseESP8266;

protected:
  std::string _streamPath = "";
  std::string _path = "";
  std::string _data = "";
  std::string _dataTypeStr = "";
  std::string _eventTypeStr = "";
  uint8_t _dataType = 0;
};

extern FirebaseESP8266 Firebase;

#endif